html/docker/storage.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>数据管理</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="repository.html"> UP </a>
 |
 <a accesskey="H" href="docker.html"> HOME </a>
</div><div id="content">
<h1 class="title">数据管理</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">数据卷</a>
<ul>
<li><a href="#sec-1-1">创建一个数据卷</a></li>
<li><a href="#sec-1-2">挂载一个主机目录作为数据卷</a></li>
<li><a href="#sec-1-3">挂载一个本地主机文件作为数据卷</a></li>
</ul>
</li>
<li><a href="#sec-2">数据卷容器</a>
<ul>
<li><a href="#sec-2-1">创建</a></li>
<li><a href="#sec-2-2">备份</a></li>
<li><a href="#sec-2-3">恢复</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">数据卷</h2>
<div class="outline-text-2" id="text-1">
<p>
数据卷是一个可供一个或多个容器使用的特殊目录，它绕过 UFS，可以提供很多有用的特性：
</p>
<ul class="org-ul">
<li>数据卷可以在容器之间共享和重用
</li>
<li>对数据卷的修改会立马生效
</li>
<li>对数据卷的更新，不会影响镜像
</li>
<li>卷会一直存在，直到没有容器使用 
</li>
</ul>

<p>
数据卷的使用，类似于 Linux 下对目录或文件进行 mount
</p>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">创建一个数据卷</h3>
<div class="outline-text-3" id="text-1-1">
<p>
在用 docker run 命令的时候，使用 -v 标记来创建一个数据卷并挂载到容器里。在一次 run 中多次使用可以挂载多个数据卷
</p>

<p>
启动镜像ubuntu的时候同时创建/webapp数据卷，结束容器后再重新启动，可以看到挂载的数据卷消失
</p>
<div class="org-src-container">

<pre class="src src-bash">$ docker run -t -i -v /webapp ubuntu /bin/bash

root@c4471819ee96:/# ls
bin  boot  dev  etc  home  lib  lib64  media  mnt  opt  proc  root  run  sbin  srv  sys  tmp  usr  var  webapp
root@c4471819ee96:/# exit

docker run -t -i ubuntu /bin/bash
root@22f2e4201b60:/# ls
bin  boot  dev  etc  home  lib  lib64  media  mnt  opt  proc  root  run  sbin  srv  sys  tmp  usr  var
</pre>
</div>

<p>
注意：可以在 Dockerfile 中使用 VOLUME 来添加一个或者多个新的卷到由该镜像创建的任意容器
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">挂载一个主机目录作为数据卷</h3>
<div class="outline-text-3" id="text-1-2">
<p>
把本机的/home/tomcat/tmp/webapp挂载到容器的/opt/webapp/下， 本地目录的路径必须是绝对路径
</p>
<div class="org-src-container">

<pre class="src src-bash">$ sudo docker run -d -P --name web -v /home/tomcat/tmp/webapp:/opt/webapp training/webapp python app.py
</pre>
</div>
<p>
挂载数据卷的默认权限是读写，用户也可以通过 :ro 指定为只读。
</p>
<div class="org-src-container">

<pre class="src src-bash">$ sudo docker run -d -P --name web -v /home/tomcat/tmp/webapp:/webapp:ro  training/webapp python app.py
</pre>
</div>
<p>
注意：Dockerfile 中不支持这种用法，这是因为 Dockerfile 是为了移植和分享用的。然而，不同操作系统的路径格式不一样，所以目前还不能支持
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">挂载一个本地主机文件作为数据卷</h3>
<div class="outline-text-3" id="text-1-3">
<p>
-v 标记也可以从主机挂载单个文件到容器中
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sudo docker run --rm -it -v ~/.bash_history:/.bash_history ubuntu /bin/bash

root@5902ae37fe1c:/# ls -a
.   .bash_history  .dockerinit  boot  etc   lib    media  opt   root  sbin  sys  usr
..  .dockerenv     bin          dev   home  lib64  mnt    proc  run   srv   tmp  var
</pre>
</div>
<p>
注意：如果直接挂载一个文件，很多文件编辑工具，包括 vi 或者 sed &#x2013;in-place，可能会造成文件 inode 的改变，从 Docker 1.1 .0起，这会导致报错误信息。所以最简单的办法就直接挂载文件的父目录
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">数据卷容器</h2>
<div class="outline-text-2" id="text-2">
<p>
如果有一些持续更新的数据需要在容器之间共享，最好创建数据卷容器。所谓数据卷容器，其实就是一个正常的容器，专门用来提供数据卷供其它容器挂载的
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">创建</h3>
<div class="outline-text-3" id="text-2-1">
<p>
创建一个命名的数据卷容器 dbdata
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sudo docker run -d -v /dbdata --name dbdata postgres echo Data-only container for postgres
</pre>
</div>

<p>
其他容器中使用 &#x2013;volumes-from 来挂载 dbdata 容器中的数据卷
</p>
<div class="org-src-container">

<pre class="src src-bash">  $ sudo docker run -t -i --volumes-from dbdata --name db1 ubuntu /bin/bash

  root@1b01849d21b8:/# df -h
  Filesystem      Size  Used Avail Use% Mounted on
  none             20G  8.2G   11G  44% /
  tmpfs           3.9G     0  3.9G   0% /dev
  shm              64M     0   64M   0% /dev/shm
  /dev/xvda1       20G  8.2G   11G  44% /dbdata 

$ sudo docker run -d --volumes-from dbdata --name db2 postgres
</pre>
</div>

<p>
可以使用多个 &#x2013;volumes-from 参数来从多个容器挂载多个数据卷，也可以从其他已经挂载了数据卷的容器来挂载数据卷
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sudo docker run -d --name db3 --volumes-from db1 postgres
</pre>
</div>
<p>
注意：使用 &#x2013;volumes-from 参数所挂载数据卷的容器自己并不需要保持在运行状态
</p>

<p>
如果删除了挂载的容器（包括 dbdata、db1 和 db2），数据卷并不会被自动删除。如果要删除一个数据卷，必须在删除最后一个还挂载着它的容器时使用 docker rm -v 命令来指定同时删除关联的容器
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">备份</h3>
<div class="outline-text-3" id="text-2-2">
<p>
使用 &#x2013;volumes-from 标记来创建一个加载 dbdata 容器卷的容器，并从本地主机挂载当前到容器的 /backup 目录，并运行压缩命令
</p>
<div class="org-src-container">

<pre class="src src-bash">$ sudo docker run --volumes-from dbdata -v $(pwd):/backup ubuntu tar cvf /backup/backup.tar dbdata
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">恢复</h3>
<div class="outline-text-3" id="text-2-3">
<p>
创建一个带有数据卷的容器 dbdata2
</p>
<div class="org-src-container">

<pre class="src src-bash">$ sudo docker run -t -i -v /dbdata --name dbdata2 ubuntu /bin/bash

root@b241be54658c:/# ls -a
.   .dockerenv   bin   dbdata  etc   lib    media  opt   root  sbin  sys  usr
..  .dockerinit  boot  dev     home  lib64  mnt    proc  run   srv   tmp  var

root@b241be54658c:/# cd dbdata/

root@b241be54658c:/dbdata# ls

root@b241be54658c:/dbdata# ls -a
.  ..
</pre>
</div>

<p>
创建另一个容器，挂载 dbdata2 数据卷和当前目录， 解压备份的文件
</p>
<div class="org-src-container">

<pre class="src src-bash">~/tmp $ ls
backup.tar

~/tmp$ sudo docker run -t -i --volumes-from dbdata2 -v $(pwd):/backup ubuntu /bin/bash

root@bd32ada636fd:/# ls
backup  bin  boot  dbdata  dev  etc  home  lib  lib64  media  mnt  opt  proc  root  run  sbin  srv  sys  tmp  usr  var

root@bd32ada636fd:/# cd backup/

root@bd32ada636fd:/backup# ls
backup.tar

root@bd32ada636fd:/#  tar xvf /backup/backup.tar
</pre>
</div>

<p>
合并在一起做
</p>
<div class="org-src-container">

<pre class="src src-sh">~/tmp$ sudo docker run --volumes-from dbdata2 -v $(<span style="color: #b0c4de;">pwd</span>):/backup ubuntu tar xvf /backup/backup.tar
</pre>
</div>

<p>
<a href="network.html">Next：网络配置</a>
</p>

<p>
<a href="repository.html">Previous：仓库</a>
</p>

<p>
<a href="docker.html">Home：目录</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
